<?php

// +----------------------------------------------------------------------
// | cuicmf 后台配置文件
// +----------------------------------------------------------------------
// | Copyright (c) 2018-2019F All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 崔元欣 <15811506097@163.com>
// +----------------------------------------------------------------------

return [
    // 应用Trace
    'app_trace' => false,
    // 异常状态页面模板
    'http_exception_template'    =>  [
        // 定义404错误的模板文件地址
        404 =>  Env::get('app_path') . 'admin/view/public/404.html',
        // 还可以定义其它的HTTP status
        401 =>  Env::get('app_path') . 'admin/view/public/401.html',
        // 定义404错误的模板文件地址
        403 =>  Env::get('app_path') . 'admin/view/public/403.html'
    ]
];