<?php

// +----------------------------------------------------------------------
// | cuicmf 后台Index模块
// +----------------------------------------------------------------------
// | Copyright (c) 2018-2019 All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 崔元欣 <15811506097@163.com>
// +----------------------------------------------------------------------

namespace app\admin\controller;

class Index extends Admin {
    
    /**
     * 控制台首页
     * @return type
     */
    public function index() {
        $this->assign('meta_title', '控制台');
        return $this->fetch();
    }
}
